{
    "title": "Present Tense - Full Explanation",
    "sections": [
        {
            "heading": "Introduction",
            "content": "The present tense is used to describe actions happening right now, daily routines, habits, and general truths. Mastering it is essential for everyday communication in Polish. By learning the present tense, you can describe your life, ask questions, narrate events, and interact naturally in conversations."
        },
        {
            "heading": "Regular Verbs",
            "content": "Regular verbs follow predictable conjugation patterns depending on the subject. Polish verbs are grouped into conjugation classes, which determine their endings. Example conjugation of 'jeść' (to eat):\n- Ja jem → I eat\n- Ty jesz → You eat\n- On/ona/ono je → He/she/it eats\n- My jemy → We eat\n- Wy jecie → You all eat\n- Oni/one jedzą → They eat\nPracticing regular verbs will help you quickly form sentences."
        },
        {
            "heading": "Irregular Verbs",
            "content": "Some of the most common verbs in Polish are irregular and do not follow standard patterns. Examples include:\n- Być (to be): Ja jestem, Ty jesteś, On/ona/ono jest, My jesteśmy, Wy jesteście, Oni/one są\n- Iść (to go): Idę, Idziesz, Idzie, Idziemy, Idziecie, Idą\n- Mieć (to have): Mam, Masz, Ma, Mamy, Macie, Mają\nMemorizing these is essential because they are used in daily conversations constantly."
        },
        {
            "heading": "Reflexive Verbs",
            "content": "Reflexive verbs include the particle 'się' and describe actions done to oneself. Examples:\n- Myję się → I am washing myself\n- Ubierasz się → You get dressed\n- On się budzi → He wakes up\nReflexive verbs are extremely common, so practicing them will improve fluency."
        },
        {
            "heading": "Time Expressions",
            "content": "Time expressions help clarify when an action happens. Common expressions include:\n- teraz → now\n- codziennie → every day\n- w każdą sobotę → every Saturday\n- zawsze → always\n- czasami → sometimes\nCombining time expressions with verbs makes your sentences more precise."
        },
        {
            "heading": "Questions and Negation",
            "content": "Forming questions in the present tense usually involves intonation or the particle 'czy'. Example:\n- Czy ty jesz obiad? → Are you eating lunch?\nNegation is formed with 'nie':\n- Nie jem obiadu. → I am not eating lunch."
        },
        {
            "heading": "Common Mistakes",
            "content": [
                "Forgetting the correct ending for the subject (e.g., 'Ja czytasz' is wrong; it should be 'Ja czytam').",
                "Mixing present tense with past or future incorrectly.",
                "Ignoring reflexive particle 'się' when required."
            ]
        },
        {
            "heading": "Connections with Other Lessons",
            "content": "For a deeper understanding, see the Conjugation lesson for detailed verb forms, the Cases lesson for noun and pronoun endings, and the Grammar & Gender lesson for sentence structure and agreement rules. Knowing these connections will help you build accurate sentences."
        },
        {
            "heading": "Usage Tips",
            "content": "Use present tense to describe daily routines, ongoing actions, habitual activities, and general truths. Always match verbs with the correct subject. Practice speaking aloud and writing short paragraphs to reinforce your skills."
        },
        {
            "heading": "Examples",
            "content": [
                "Ja czytam książkę. → I am reading a book.",
                "Oni idą do szkoły. → They are going to school.",
                "Ty pijesz kawę codziennie. → You drink coffee every day.",
                "My oglądamy film w salonie. → We are watching a movie in the living room.",
                "Ona ubiera się szybko rano. → She gets dressed quickly in the morning.",
                "Zawsze piję herbatę o poranku. → I always drink tea in the morning.",
                "Czy oni pracują teraz? → Are they working now?",
                "Nie jem mięsa. → I don’t eat meat."
            ]
        },
        {
            "heading": "Practice Exercises",
            "content": [
                "Write 5 sentences describing what you do every day using the present tense.",
                "Convert 5 sentences from English to Polish.",
                "Form questions and negatives for the sentences you wrote.",
                "Try to include reflexive verbs and time expressions in your sentences."
            ]
        },
        {
            "heading": "Tips for Fluency",
            "content": [
                "Speak aloud and describe your day in Polish.",
                "Listen to native speakers and pay attention to verb endings.",
                "Practice forming both affirmative and negative sentences.",
                "Combine present tense verbs with vocabulary from the Vocabulary lesson."
            ]
        }
    ]
}